import Image from "next/image";
import { useState } from "react";

const AboutUs = () => {
  const [openOne, setOpenOne] = useState("");

  return (
    <>
      <div
        className="container lg:mx-auto lg:px-16 px-3 bg-white rounded-[10px] leading-10 text-justify"
        style={{ boxShadow: "0px 4px 20px rgba(0, 0, 0, 0.08)" }}
      >
        <div className="text-[#005BEA] font-bold text-xl mt-16 mb-6 lg:text-center pt-12">
          درباره ما{" "}
        </div>
        <p className="font-medium text-[#5D6F7E] mb-6">
          صاب‌ملک پلت‌فرم تامین مالی جمعی و بدون وقفه پروژه‌های ساخت با مدیریت
          سودآور برای سرمایه‌گذاران است. سرمایه‌گذاری در ساخت و ساز از پرسودترین
          فعالیت های اقتصادی در کشور است. اما ورود به این حوزه نیازمند تخصص،
          سرمایه زیاد، و صرف وقت و انرژی قابل توجه است. ما می‌خواهیم مردم عادی
          هم بدون نیاز به صرف وقت و هزینه ی قابل توجه و با هر مقدار سرمایه در
          این فعالیت اقتصادی شرکت کنند. به همین منظور با تحقیقات فراوان و
          مطالعه‌ی تجربیات سازندگان مختلف، تعاونی‌های مسکن، شرکت‌های
          سرمایه‌گذاری مسکن و سرمایه گذاران حقیقی، مدل منحصربه‌فردی را طراحی
          کرده‌ایم که با تامین مالی جمعی به مدیریت سرمایه گذاری در پروژه های
          ساخت بپردازیم.
        </p>

        <div>
          <div className="relative w-full">
            <img src="/img/submelk/aboutUs1.png" width="100%" />
          </div>
        </div>

        <p className="font-medium text-[#5D6F7E] my-6">
          هدف اصلی در طراحی پلتفرم صاب‌ملک بهینه‌سازی سود و حداقل سازی ریسک برای
          مشتریان صاب‌ملک، بدون نیاز به تخصص یا صرف وقت از طرف مشتری بوده است.
          در پلتفرم ما، سازندگان به عنوان پیمانکار به ساخت پروژه می‌پردازند و
          صرفاً با مدیریت پیمان کسب درآمد می‌کنند. سازندگان در پروژه‌های صاب‌ملک
          درآمد مشخصی از پروژه کسب می‌کنند که از پیش تعیین شده است و در صورت
          اجرای بهینه و به موقع می‌تواند تا مقدار محدودی افزایش یابد. شرکت
          صاب‌ملک نیز مسئول تامین مالی و مدیریت ورود، اجرا، و فروش پروژه‌ها است.
          در قبال این خدمات شرکت صاب‌ملک درصدی از معاملات خرید و فروش به عنوان
          کمیسیون دریافت می‌کند. و در نهایت سرمایه‌گذاران، که مشتریان صاب‌ملک
          هستند، مالک تقریباً همه‌ی سود ایجاد شده در فعالیت ساخت و ساز خواهند
          بود.
        </p>
        <p className="font-medium text-[#5D6F7E] my-6">
          ما در صاب‌ملک با ایجاد اکوسیستمی که در آن منافع همه‌ی بازیگران
          هم‌راستا با منافع سرمایه‌گذاران باشد، از ریسک‌های سرمایه‌گذاری تا حد
          ممکن کاسته‌ایم. تنها راه درآمدی ما فقط از کمیسیون ورود و خروج سرمایه
          می‌باشد. لذا خود ما هم انگیزه داریم که بیشترین سود را برای مشتریانمان
          ایجاد کنیم. ما بر فعالیت سازنده نظارت دقیق داریم و حسن اجرای پروژه را
          به صورت روزانه رصد می‌کنیم. برای این‌که سازنده انگیزه‌ی درونی برای
          ساخت سریع و با بهترین قیمت داشته باشد، علاوه‌بر مشوق‌های قراردادی،
          سازنده‌ها در صاب‌ملک موظف هستند تا تعدادی از صاب‌های پروژه را خریداری
          کنند.
        </p>
        <div className="lg:hidden">
          <img
            src="/img/submelk/aboutUs3.png"
            className="w-full lg:w-[623]"
            alt="about"
          />
        </div>
        <p className="font-medium text-[#5D6F7E] my-6">
          علاوه بر یک اکوسیستم بهینه داخلی، ما در صاب‌ملک اقدام به ایجاد تیم‌های
          تخصصی و روابط بلندمدت استراتژیک با بازیگران دیگر می‌کنیم. تیم‌های
          تخصصی صاب‌ملک با تجربه‌ی کار بر روی پروژه‌های مختلف و مدیریت علمی و
          متمرکز، بسیاری از ریسک‌هایی که یک سرمایه‌گذار حقیقی را تهدید می‌کند
          کاهش داده یا به کلی برطرف می‌کنند. از طرف دیگر، صاب‌ملک به واسطه‌ی
          تعداد و حجم پروژه‌ها دارای آشنایی کامل با بازیگران موثر و شرایط موجود
          در بازار است.
        </p>

        <div className="flex flex-col lg:flex-row items-center justify-evenly mt-20 gap-10 pb-20">
          <div className="hidden lg:block">
            <img
              src="/img/submelk/aboutUs3.png"
              className="w-full lg:w-[623]"
              alt="about"
            />
          </div>
          <div>
            <img
              src="/img/submelk/aboutUs2.png"
              className="w-full lg:w-[426]"
              alt="about"
            />
          </div>
        </div>
      </div>
      <style jsx global>
        {`
          body {
            background-color: #f7f8fc;
          }
        `}
      </style>
    </>
  );
};

export default AboutUs;
